
#Область СлужебныйПрограммныйИнтерфейс

#Область ПрограммноеПеречисление

Функция ПрограммноеПеречисление() Экспорт

	Возврат Новый Структура;	

КонецФункции

Функция ЭтоПрограммноеПеречисление(Знач Значение) Экспорт

	Если ТипЗнч(Значение) = Тип("Структура") Тогда
		Для Каждого КлючИЗначение Из Значение Цикл
			Если ЭтоЗначениеПрограммногоПеречисления(КлючИЗначение.Значение) Тогда
				Возврат Истина;	
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	Возврат Ложь;	

КонецФункции


Функция ДобавитьЗначениеПрограммногоПеречисления(Знач ПрограммноеПеречисление,
	Знач Имя,
	Знач Значение = Неопределено,
	Знач Передставление = Неопределено) Экспорт

	Имя = ВРег(Имя);
	
	ПрограммноеПеречисление.Вставить(Имя,
		ЗначениеПрограммногоПеречисления(Имя,
			Значение,
			?(Передставление <> Неопределено, Передставление, Имя)));
	
	Возврат ПрограммноеПеречисление;

КонецФункции

Функция ЗначениеПрограммногоПеречисления(Знач Имя, Знач Значение = Неопределено, Знач Представление = Неопределено) Экспорт

	Возврат Новый Структура("ЭтоЗначениеПрограммногоПеречисления, Имя, Значение, Представление",
		Истина,
		Имя,
		Значение,
		Представление);	

КонецФункции

Функция ЭтоЗначениеПрограммногоПеречисления(Знач Значение) Экспорт

	Возврат ТипЗнч(Значение) = Тип("Структура")
		И Значение.Свойство("ЭтоЗначениеПрограммногоПеречисления")
		И Значение.ЭтоЗначениеПрограммногоПеречисления;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//
#КонецОбласти